# Варіанти задати кількість циклів
# За допомогою лічильника циклів:
counter = 5
while counter != 0:
    print("Всередині циклу.", counter)
    counter = counter - 1 # counter -= 1
print("За межами циклу.", counter)
 
# За допомогою range 0-9:
for i in range(10):
 print("Значення i зараз дорівнює", i)
 
# За допомогою range 2-7:
for i in range(2, 8):
    print("Значення i зараз дорівнює", i)
    
# Множина, згенерована функцією range(), 
# повинна бути відсортована за зростанням. 
# Неможливо змусити функцію range() створити 
# множину в іншому вигляді, коли функція range() 
# приймає саме два аргументи. Це означає, що другий 
# аргумент range() повинен бути більшим за перший.

    
# За допомогою range 2-8 з інкрементом (третій аргумент):
for i in range(2, 9, 3):
 print("Значення i зараз дорівнює", i)

# Перший аргумент, що передається у функцію range(), 
# вказує на початковий номер послідовності (звідси 2 на виході). 
# Другий аргумент вказує функції, де закінчується послідовність 
# (функція генерує числа, до числа вказаного в другому аргументі, 
# але не включає його). Нарешті, третій аргумент вказує на крок, 
# який фактично дорівнює різниці між прилеглими числами у 
# згенерованій функцією послідовності чисел.
 
# Розглянемо коротку програму, метою якої є обчислення декількох перших степенів двійки:
power = 1
for expo in range(16):
    print("2 в степені", expo, "дорівнює", power)
    power *= 2 # power = power * 2