# Деякі приклади використання print

# Перенесення строк
print("Python (найчастіше вживане прочитання — «Па́йтон»,\nзапозичено назву з британського шоу Монті Пайтон) \n— інтерпретована об'єктно-орієнтована мова \nпрограмування високого рівня із суворою динамічною типізацією. ")

# Aргумент ключового слова end=
print("Мене звуть", "Пайтон.", end=" ")
print("Монті Пайтон.")

print("Мене звати ", end="")
print("Монті Python.")

#Aргумент ключового слова sep=
print("Мене", "звати", "Монті", "Пайтон.", sep="-")
print("Мене", "звати", "Монті", "Пайтон.", sep="**")

# Множення строки (подвоєння, потроєння і тп), "string" * х
print("Монті Python." * 3)

# Екранування символів за допомогою \
print("Офіційний канал \"Перший\"")
print(" \"\"\" ")
