# У цьому прикладі ми вказуємо, що змінна data — це список, що містить рядки, а параметр функції process має бути
# словником з рядками у ролі ключів та цілими числами як значення. Додатково ми інформуємо що функція має повернути тип float.
# Ці анотації не змінюють роботу інтерпретатора, і ніякої перевірки не виконується,
# але це дозволяє створення зовнішніх інструментів перевірки типів, а також спрощує роботу IDE.

from typing import List, Dict

data: List[str] = ["Some", "values"]


def process(info: Dict[str: int]) -> float:
    info["test"] = 1

    return 0
