# Через те, що дробові числа з плаваючою точкою зберігаються в двійковому вигляді,
# ми зазвичай працюємо з приблизними значеннями, як у першому варіанті в наведеному коді.

from fractions import Fraction
from decimal import Decimal
format(0.1, '.17f')
'0.10000000000000001'

Decimal(1) / Decimal(3)
Decimal('0.3333333333333333333333333333')
(Decimal(1) / Decimal(3)) * Decimal(3) == Decimal(1)
False

(Fraction(1) / Fraction(3)) * Fraction(3)) = Fraction(1)
True

# Для отримання більш точних результатів можна використовувати клас Decimal,
# але і його може не вистачити в деяких випадках.

# В такому разі, для ідеальних обчислень краще використовувати клас Fraction,
# бо він працює з числами у вигляді раціональних дробів.
