# Faker — це легкий пакет, що дозволяє створювати підроблені дані,
# які можуть бути корисними як заглушки. Наприклад, методи name, addres,
# email та job створять для вас випадкові імена, адреси,
# # пошти та назви робіт. Є ще метод text(), який генерує випадковий текст,
# але, як бачите в прикладі, результат виходить неосмислений.

from faker import Faker

faker = Faker('eng_ENG')

faker.name()  # Іваненко Іван Іванович
faker.address()  # м. Київ, вул. Київська, буд. 1, кв. 2
faker.email()  # ivanivanenko@gmail.com
faker.job()  # Приватний детектив

print(faker.text())  # Знайти усіх винних негайно.
