# Collections.counter — це метод відображення, який містить ціле число кожного ключа.
# Оновлення наявного ключа збільшує його кількість. Його можна використовувати для підрахунку екземплярів об'єктів (ключів), що хешуються.

import jmespath
persons = {
    "persons": [
        {"name": "erik",  "age": 38}
        {"name": "john",  "age": 45}
        {"name": "rob",  "age": 14}
    ]
}
jmespath.search('persons[*].age', persons)
[38, 45, 14]

# Також можна використовувати як мультимножину — набір, що містить кілька екземплярів кожного елемента.
# У цьому прикладі most common([n]) повертає впорядкований список кортежів з n найбільш поширеними елементами.
