# Модуль math є стандартним модулем в Python і завжди доступний.
# Щоб використовувати математичні функції цього модуля, необхідно
# імпортувати модуль за допомогою стейтменту import math.

import math

x = 5
y = 3

ceil(x)  # Повертає найменше ціле число, більше чи рівне x.
copysign(x, y)  # Повертає x зі знаком y.
fabs(x)  # Повертає абсолютне значення x.
factorial(x)  # Повертає факторіал x.
floor(x)  # Повертає найбільше ціле число, менше чи рівне x.
fmod(x, y)  # Повертає остачу при діленні x на y.
frexp(x)  # Повертає мантису та експоненту x у вигляді пари (m, e).
# Повертає точну суму значень типу з плаваючою крапкою в інтегрованому об’єкті.
fsum(ітерований_об’єкт)
# Повертає True, якщо x не є ні нескінченністю, ні NaN (Not a Number).
isfinite(x)
isinf(x)  # Повертає True, якщо x є додатною або від’ємною нескінченністю.
isnan(x)  # Повертає True, якщо x є NaN.
ldexp(x, i)  # Повертає x * (2**i).
modf(x)  # Повертає дробову та цілу частини x.
# Повертає “зрізане” цілочисельне значення x (відкидає дробову частину числа).
trunc(x)
exp(x)  # Повертає e**x.
expm1(x)  # Повертає e**x – 1.
log(x[, b])  # Повертає логарифм x за основою b (за замовчуванням e).
log1p(x)  # Повертає натуральний логарифм 1+x.
log2(x)  # Повертає логарифм x за основою 2.
log10(x)  # Повертає логарифм x за основою 10.
pow(x, y)  # Повертає x, піднесений до степеня y.
sqrt(x)  # Повертає квадратний корінь з x.
acos(x)  # Повертає арккосинус x.
asin(x)  # Повертає арксинус x.
atan(x)  # Повертає арктангенс x.
atan2(y, x)  # Повертає значення atan(y/x) (в радіанах).
cos(x)  # Повертає косинус x.
# Обчислює гіпотенузу трикутника з катетами x та y (math.sqrt(x * x + y * y)).
hypot(x, y)
sin(x)  # Повертає синус x.
tan(x)  # Повертає тангенс x.
degrees(x)  # Перетворення кута x з радіанів у градуси.
radians(x)  # Перетворення кута x з градусів у радіани.
acosh(x)  # Повертає зворотний гіперболічний косинус x.
asinh(x)  # Повертає зворотний гіперболічний синус x.
atanh(x)  # Повертає зворотний гіперболічний тангенс x.
cosh(x)  # Повертає гіперболічний косинус x.
sinh(x)  # Повертає гіперболічний синус x.
tanh(x)  # Повертає гіперболічний тангенс x.
erf(x)  # Повертає функцію помилки у точці x.
erfc(x)  # Повертає додаткову функцію помилки у точці x.
gamma(x)  # Повертає Гамма-функцію у точці x.
# Повертає натуральний логарифм абсолютного значення Гамма-функції у точці x.
lgamma(x)
# Математична константа Пі, що дорівнює відношенню довжини кола до його діаметра (3,14159…).
pi
e  # Математична константа e (2,71828…).
