# У модулі math є особливий об'єкт, який називається NaN (Not a Number).
# Ці об'єкти не є унікальними, і навіть не рівні самим собі, тож можна мати кілька подібних об'єктів, взятих з різних джерел.

import math
math.nan == math.nan
False

float('nan')
nan
float('nan') is float('nan')
False

d = {}
d[float('nan')] = 1
d[float('nan')] = 2
d
{nan: 1, nan: 2}

# Наприклад, можна створити подібний об'єкт, просто передавши рядок 'nan' у float.
# До речі, це означає, що ви можете використовувати NaN як ключ у словнику (хоча ми і не радимо це робити).
