# Якщо ви використовуєте варіант модуля імпорту і вам не подобається ім’я певного модуля
# (наприклад, воно збігається з однією з ваших уже визначених сутностей, тому кваліфікація стає складною),
# ви можете дати йому будь-яке ім’я, яке вам подобається – це називається псевдонімом .

# Syntax: import module as alias

# після успішного виконання псевдонімного імпорту оригінальне ім’я модуля стає недоступним і його не можна використовувати.
import math as m

print(m.sin(m.pi/2))


# У свою чергу, коли ви використовуєтез імені імпорту модуляваріант, і вам потрібно змінити назву функції,
# ви створюєте псевдонім для функції. Це призведе до того, що ім’я буде замінено вибраним вами псевдонімом.

# Syntax: from module import name as alias
# from module import n as a, m as b, o as c

# Example

# from math import pi as PI, sin as sine
# print(sine(PI/2))
