# В Python можна вирішити задачу конвертації з одного аудіо-формату в інший безліччю способів — наприклад,
# модулем pydub, який є інтерфейс-надбудовою над ffmpeg і дозволяє завантажувати, редагувати та зберігати
# аудіо-файли у будь-якому форматі, що підтримується ffmpeg.
# Для завантаження файлу вибираємо функцію from_ з відповідним форматом у назві класу AudioSegment.
# Також можна скористатись найбільш загальною функцією from_file, передавши шлях до файлу та його формат.

# Для експорту файлу з потрібним форматом, у який ми хотіли його конвертувати,
# використовуємо функцію export в отриманому після завантаження файлу об'єкті класу AudioSegment.

from pydub import AudioSegment

test_mp3 = AudioSegment.from_mp3('test.mp3')
test_mp3.export('test.wav', format='wav')

mix_m4a = AudioSegment.from_file('mix.m4a', format='m4a')
mix_m4a.export('mix.wav', format='wav')
