# Із вбудованим модулем shutil багато хто вже, ймовірно, знайомий, але його зазвичай використовують у контексті завдань копіювання, перенесення файлів і папок.

# Але за допомогою shutil можна отримати навіть інформацію про пам'ять на жорсткому диску. Метод disk_usage повертає кількість всієї, зайнятої та вільної пам'яті.

import shutil

total_b, used_b, free_b = shutil.disk_usage('.')

gb = 10 ** 9

print('Total: {:6.2f} GB'.format(total_b / gb))
print('Used: {:6.2f} GB'.format(used_b / gb))
print('Free : {:6.2f} GB'.format(free_b / gb))

# Output:
# Total: 245.11 GB
# Used : 128.38 GB
# Free: 99.04 GB

# Так як всі три значення повертаються в байтах, у прикладі ми їх перевели та вивели у гігабайти для кращої наочності.
