# СhainMap групує кілька словників чи інших зіставлень разом, щоб створити єдине представлення — коли треба згрупувати словники в один або ж працювати з множиною словників.
# ChainMap представляє той самий інтерфейс, як і словник, але з додатковими можливостями, а також створює обновлюване представлення і бачить зовнішні зміни у вхідних відображеннях.

from collections import ChainMap

numbers = {"one": 1, "two": 2}
letters = {"a": "A", "b": "B"}

print(ChainMap(numbers, letters))
"""ChainMap({'one': 1, 'two': 2}, {'a': 'A', 'b': 'B'})"""
