# Стандартна ставка за 40 робочих годин та 1.5-кратна ставка за години, відпрацювані понад стандартні 40 годин.
hours = input("Відпрацьовано годин:")
rate = input("Стандартна ставка:")
try:
    hrs = float(hours)
    rt = float(rate)
except ValueError:
    print("Помилка: Будь ласка введіть числове значення.")
    quit()
# Якщо відпрацьовано 40 годин і менше
if hrs <= 40:
    pay = hrs * rt
# Якщо відпрацьовано більше 40 годин
elif hrs > 40:
    pay = (40 * rt) + (hrs % 40) * (rt * 1.5)
# Якщо не працювали
elif hrs == 0:
    print ('Ви не працювали.')
# Результат
print ("Відпрацьовано годин:", hrs)
print ("Заробітна плата:", pay)