# Функція для обчислення заробітної плати
def calcpay(h, r):
    # Якщо відпрацьовано 40 годин або менше
    if h <= 40:
        pay = h * r
    # Якщо відпрацьовано більше 40 годин
    else:
        pay = (40 * r) + (h % 40) * (r * 1.5)
    return pay
# Стандартна ставка за 40 робочих годин та 1.5-кратна ставка за години, відпрацювані понад стандартні 40 годин.
hours = input("Відпрацьовано годин:")
rate = input("Стандартна ставка:")
try:
    hrs = float(hours)
    rt = float(rate)
except ValueError:
    print("Помилка: Будь ласка введіть числове значення.")
    quit()
# Виклик функції для очислення
cp = calcpay(hrs, rt)
# Результат
print("Заробітна плата:", cp)
