# Ваше завдання – написати податковий калькулятор.
# якщо дохід громадянина не перевищував 85 528 талерів, то податок дорівнював 18% від доходу мінус 556 талерів і 2 центи (це так звана податкова пільга);
# якщо дохід перевищував цю суму, то податок дорівнював 14 839 талерам і 2 центам, плюс 32% від надлишку понад 85 528 талерів.
try:
    income = float(input("Введіть річний дохід: "))
except ValueError:
    print("Помилка: Будь ласка введіть числове значення.")
    quit()
if income < 85528:
    tax = income * 0.18 - 556.02
else:
    tax = (income - 85528) * 0.32 + 14839.02

if tax < 0.0:
    tax = 0.0

tax = round(tax, 0)
print("Податок склав:", tax, "талера")
