# Уявимо завдання: потрібно створити новий список, елементами якого будуть
# квадрати чисел іншого списку. Більшість одразу напишуть цикл for. Але такий
# підхід займе щонайменше три рядки: оголошення нової змінної, створення циклу
# і коду всередині нього. Крім того, знижується швидкість роботи скрипта.
# вихідний список чисел

numbers = [1, 2, 3, 4, 5]

# через цикл for

squares = []

for num in numbers:
    squares.append(num * num)
print(squares)

# через генератор списку

squares = [num * num for num in numbers]
print(squares)

# через функцію map

squares = map(lambda x: x * x, numbers)
print(squares)
