# Функція для зчитування цілого числа з введення користувача з перевіркою на допустимий діапазон
def read_int(prompt, min, max):
    ok = False  # Ініціалізація прапорця для перевірки правильності введення
    while not ok:  # Цикл продовжується, поки не буде отримано правильне введення
        try:
            # Запитуємо у користувача введення та перетворюємо його на ціле число
            value = int(input(prompt))
            ok = True  # Якщо перетворення вдалося, встановлюємо прапорець в True
        except ValueError:  # Якщо сталося виключення ValueError, то введення було неправильним
            print("Error: wrong input")  # Виводимо повідомлення про помилку
        if ok:  # Перевіряємо, чи значення знаходиться в допустимому діапазоні
            # Прапорець встановлюється в True, якщо значення в межах діапазону
            ok = value >= min and value <= max
        if not ok:  # Якщо значення поза допустимим діапазоном
            print("Error: the value is not within permitted range (" + str(min) +
                  ".." + str(max) + ")")  # Виводимо повідомлення про помилку
    return value  # Повертаємо правильне значення


# Викликаємо функцію read_int з повідомленням і діапазоном від -10 до 10
v = read_int("Enter a number from -10 to 10: ", -10, 10)

# Виводимо введене число
print("The number is:", v)
