my_dict = {}  # створюємо порожній словник для вхідних даних

# Додаємо перший ключ
key_1 = input("Будь-ласка введіть ім'я для першого ключа: ")
value_1 = input("Будь-ласка введіть значення для першого ключа: ")

my_dict[key_1] = value_1

# Додаємо другий ключ
key_2 = input("Будь-ласка введіть ім'я для другого ключа: ")
value_2 = input("Будь-ласка введіть значення для другого ключа: ")

my_dict[key_2] = value_2

# Додаємо третій ключ
key_3 = input("Будь-ласка введіть ім'я для третього ключа: ")
value_3 = input("Будь-ласка введіть значення для третього ключа: ")

my_dict[key_3] = value_3

print(my_dict)
