# Уявіть собі список – не дуже довгий, не дуже складний, просто список, який містить кілька цілих чисел.
# Деякі з цих чисел можуть повторюватися, і це підказка. Ми не хочемо жодних повторів. Ми хочемо, щоб їх прибрали.
# Ваше завдання - написати програму, яка видаляє зі списку всі числа, що повторюються.
# Мета ‒ отримати список, в якому всі цифри зустрічаються не більше одного разу.
# Примітка: припустимо, що вихідний список жорстко закодований всередині коду ‒ вам не потрібно вводити його з клавіатури.
# Підказка: ми рекомендуємо вам створити новий список, як тимчасову робочу зону ‒ вам не потрібно оновлювати ваш вхідний список.

# Перший варіант вирішення
my_list = [1, 4, 41, 4, 1, 200, 4, 2, 6, 36, 36, 2,
           9, 2, 42, 13, 88, 36, 49, 114, 99, 41, 9, 63, 200]

unique_list = []  # Створюємо пустий список для унікальних елементів

for item in my_list:  # Перевіряємо кожен елемент у вихідному списку
    if item not in unique_list:  # Якщо елемент ще не додано до унікального списку, додаємо його
        unique_list.append(item)

# Виводимо список з унікальними елементами
print("Список тільки з унікальними елементами:")
print(unique_list)

# Другий варіант вирішення
my_list = [1, 4, 41, 4, 1, 200, 4, 2, 6, 36, 36, 2,
           9, 2, 42, 13, 88, 36, 49, 114, 99, 41, 9, 63, 200]

unique_set = set(my_list)  # Створюємо множину, щоб видалити повтори
unique_list = list(unique_set)  # Перетворюємо множину назад у список

# Виводимо список з унікальними елементами
print("Список тільки з унікальними елементами:")
print(unique_list)
