# Уявімо собі наступну задачу:
# потрібна програма для визначення середньої оцінки студентів;
# програма повинна запитувати ім'я студента, а потім його/її особисту оцінку;
# імена можна вводити в будь-якому порядку;
# введення пустого імені завершує введення даних, після цього має бути виданий список усіх імен разом з визначеним середнім балом.
school_class = {} # створюємо порожній словник для вхідних даних

while True:
    name = input("Введіть ім'я студента: ") #  ім'я студента
    if name == '': # якщо ім'я є порожнім рядком (), виведемо з циклу
        break
    try:
        score = int(input("Введіть оцінку студента (1-12): ")) # запитується одна з оцінок студента
    except ValueError:
        print("Помилка: Введіть оцінку від 1 до 12")
        continue 
    if score not in range(1, 13):
            break
    
    if name in school_class: # якщо прізвище студента вже є в словнику, подовжити пов'язаний кортеж з новою оцінкою
        school_class[name] += (score,)
    else:
        school_class[name] = (score,) # якщо це новий студент (невідомий словнику), створити новий запис - його значенням буде одноелементний кортеж з введеною оцінкою
        
for name in sorted(school_class.keys()): # перебрати відсортовані імена студентів
    adding = 0 #  ініціалізація даних, необхідних для обчислення середньої оцінки (сума та лічильник)
    counter = 0
    for score in school_class[name]: # виконуємо ітерації по кортежу, беручи всі наступні оцінки і оновлюючи суму разом з лічильником
        adding += score
        counter += 1
    print(name, ":", adding / counter) # виводимо ім'я студента та його середню оцінку
