# Функція bytearray() повертає об’єкт bytearray, який є масивом вказаних байтів.
# bytearray([source[, encoding[, errors]]])
# Функція bytearray() повертає об’єкт bytearray (тобто масив байтів), який є змінюваною (може змінюватися) послідовністю цілих чисел у діапазоні 0 <= x < 256.
# Якщо ви хочете незмінну версію, скористайтеся функцію bytes().
# Функція bytearray() приймає три необов’язкові параметри:
#    source (необов’язково) — об’єкт для ініціалізації масиву байтів;
#    encoding (необов’язково) — якщо об’єктом є рядок, необхідно вказати кодування рядка;
#    errors (необов’язково) — якщо об’єктом є рядок, вказуємо дію, яку необхідно зробити у разі збою кодування рядка

prime_numbers = [2, 3, 5, 7]

# Конвертуємо список у bytearray
byte_array = bytearray(prime_numbers)
print(byte_array)


# Масив байтів із рядка

string = "Python is interesting."

# Рядок з кодуванням 'utf-8'
arr = bytearray(string, 'utf-8')
print(arr)


# Масив байтів вказаного цілочисельного розміру

size = 5

arr = bytearray(size)
print(arr)


# Масив байтів з ітерованого списку

rList = [1, 2, 3, 4, 5]

arr = bytearray(rList)
print(arr)
