# Функція bytes() повертає незмінюваний об’єкт bytes, ініціалізований вказаними даними та розміром.
# Функція bytes() повертає об’єкт bytes, який є незмінною (не може бути зміненим) послідовністю цілих чисел у діапазоні 0 <= x < 256.
# Якщо ви хочете змінювану версію, використовуйте функцію bytearray().
# Функція bytes() приймає три необов’язкові параметри:
#    source (необов’язково) — об’єкт для ініціалізації масиву байтів;
#    encoding (необов’язково) — якщо об’єктом є рядок, необхідно вказати кодування рядка;
#    errors (необов’язково) — якщо об’єктом є рядок, вказуємо дію, яку необхідно зробити у разі збою кодування рядка

message = 'Python is fun'

# Конвертуємо рядок у байти
byte_message = bytes(message, 'utf-8')
print(byte_message)


# Конвертація рядка в об’єкт bytes

string = "Python is interesting."

# Рядок з кодуванням 'utf-8'
arr = bytes(string, 'utf-8')
print(arr)


# Створення об’єкта bytes вказаного цілочисельного розміру

size = 5

arr = bytes(size)
print(arr)


# Конвертація ітерованого списку в об’єкт bytes

rList = [1, 2, 3, 4, 5]

arr = bytes(rList)
print(arr)
