# Функція bytes() повертає незмінюваний об’єкт bytes, ініціалізований вказаними даними та розміром.
# Функція bytes() повертає об’єкт bytes, який є незмінною (не може бути зміненим) послідовністю цілих чисел у діапазоні 0 <= x < 256.
# Якщо ви хочете змінювану версію, використовуйте функцію bytearray().
# Функція bytes() приймає три необов’язкові параметри:
#    source (необов’язково) — об’єкт для ініціалізації масиву байтів;
#    encoding (необов’язково) — якщо об’єктом є рядок, необхідно вказати кодування рядка;
#    errors (необов’язково) — якщо об’єктом є рядок, вказуємо дію, яку необхідно зробити у разі збою кодування рядка

message = 'Python is fun'

# Конвертуємо рядок у байти
byte_message = bytes(message, 'utf-8')
print(byte_message)
