# цикл for виконує набір операторів багато разів; використовується для перебору
# послідовностей (наприклад, списків, словників, кортежів або множин або інших об'єктів,
# які можна перебирати (наприклад, рядків).
# За допомогою циклу for можна перебирати послідовність чисел, використовуючи вбудовану функцію range.
# приклад 1
word = "Python"
for letter in word:
    print(letter, end="*")
 
# приклад 2
for i in range(1, 10):
    if i % 2 == 0:
        print(i)
 
# Простий приклад циклу for
names = ["Денис", "Василь", "Валерій", "Олександра", "Сергій", "Яна"]
for name in names:
    print("Поздоровляю,", name, "!")
    
# Списки можна перебирати за допомогою циклу for, наприклад:
my_list = ["білий", "пурпурний", "блакитний", "жовтий", "зелений"]
 
for color in my_list:
    print(color)