# Декоратор - це функція, яка приймає іншу функцію як аргумент
# і розширює її функціональність без зміни коду.
#  Декоратори можуть використовуватись для додавання логування,
# перевірки аутентифікації, таймінгу виконання та інших аспектів.


def my_decorator(func):
    def wrapper():
        print("Додатковий код, який виконується перед викликом функції")
        func()
        print("Додатковий код, який виконується після виклику функції")
    return wrapper


@my_decorator
def say_hello():
    print("Привіт!")


say_hello()
