# Метод dict.fromkeys() створює новий словник із заданого об'єкта,
# що ітерується (рядок, список, набір, кортеж) в якості ключів і з зазначеним значенням.

keys = {'a', 'e', 'i', 'o', 'u'}
value = 'vowel'

vowels = dict.fromkeys(keys, value)
print(vowels)
# {'i': 'vowel', 'u': 'vowel', 'e': 'vowel', 'a': 'vowel', 'o': 'vowel'}

# Він також може бути забезпечений змінним об'єктом як значення за замовчуванням.
# І тут робиться глибока копія словника. Якщо додаємо значення до вихідного списку,
# то додавання відбувається у всіх значеннях ключів.
