# Функція divmod() приймає два числа як аргументи та повертає їх частку та остачу в кортежі.
# Функція divmod() приймає два параметри:
#    number1 — чисельник, може бути цілим числом або числом з плаваючою крапкою;
#    number2 — знаменник, може бути цілим числом або числом з плаваючою крапкою.

# Повертає частку та остачу від операції 8/3
result = divmod(8, 3)

print('Quotient and Remainder = ', result)


# Функція divmod() в Python із цілими аргументами

# Функція divmod() із цілочисельними аргументами
print('divmod(8, 3) = ', divmod(8, 3))

# Функція divmod() із цілочисельними аргументами
print('divmod(3, 8) = ', divmod(3, 8))

# Функція divmod() із цілочисельними аргументами
print('divmod(5, 5) = ', divmod(5, 5))


# Функція divmod() в Python з дробовими аргументами

# Функція divmod() з дробовими аргументами
print('divmod(8.0, 3) = ', divmod(8.0, 3))

# Функція divmod() з дробовими аргументами
print('divmod(3, 8.0) = ', divmod(3, 8.0))

# Функція divmod() з дробовими аргументами
print('divmod(7.5, 2.5) = ', divmod(7.5, 2.5))

# Функція divmod() з дробовими аргументами
print('divmod(2.6, 0.5) = ', divmod(2.6, 0.5))

# Функція divmod() у Python з нечисловими аргументами (TypeError)

# Функція divmod() з рядковими аргументами
a = divmod("Jeff", "Bezos")

print('The divmod of Jeff and Bezos is = ', a)
