# Функція exec() виконує динамічно створену програму, яка є рядком або об’єктом коду.
# exec(object, globals, locals)
# Функція exec() приймає три параметри:
#    object — рядок або об’єкт коду;
#    globals (не обов’язково) — словник;
#    locals (не обов’язково) — об’єкт для зіставлення (зазвичай словник).

from math import *
program = 'a = 5\nb=10\nprint("Sum =", a+b)'
exec(program)

# Функція exec() з однорядковим програмним вводом

# Отримуємо всю програму в якості вхідних даних
program = input('Enter a program:')

# Виконуємо програму
exec(program)


# Перевірка доступного коду за допомогою функції exec()

# Імпортуємо всі функції з бібліотеки math

# Перевіряємо доступні функції
exec('print(dir())')
