# Функція exec() виконує динамічно створену програму, яка є рядком або об’єктом коду.
# exec(object, globals, locals)
# Функція exec() приймає три параметри:
#    object — рядок або об’єкт коду;
#    globals (не обов’язково) — словник;
#    locals (не обов’язково) — об’єкт для зіставлення (зазвичай словник).

from math import *
program = 'a = 5\nb=10\nprint("Sum =", a+b)'
exec(program)

# Функція exec() з однорядковим програмним вводом

# Отримуємо всю програму в якості вхідних даних
program = input('Enter a program:')

# Виконуємо програму
exec(program)


# Перевірка доступного коду за допомогою функції exec()

# Імпортуємо всі функції з бібліотеки math

# Перевіряємо доступні функції
exec('print(dir())')


# Використання необхідних функцій та змінних у функції exec()
# Ми заблокували всі глобальні вбудовані функції за допомогою наступного рядка коду:
# globalsParameter = {'__builtins__' : None}
# Але дозволили виконання двох функцій: print() та dir(), разом із кодом:
# localsParameter = {'print': print, 'dir': dir}
# Нарешті, ми передали функцію dir() усередину функції print(), а потім передали все у функцію exec() для виведення списку доступних функцій.
# Тут globalsParameter та localsParameter є необов’язковими параметрами, які ми використали з функцією exec() для виводу лише тих функцій, до яких хочемо отримати доступ.

# Встановлюємо параметру globals значення None
globalsParameter = {'__builtins__': None}

# Встановлюємо параметр locals, щоб він приймав лише функції print() та dir()
localsParameter = {'print': print, 'dir': dir}

# Виводимо список доступних функцій
exec('print(dir())', globalsParameter, localsParameter)


# Блокування непотрібних функцій та змінних у функції exec()
# У більшості випадків нам не потрібні всі функції та змінні функції exec().
# Ми можемо заблокувати ці непотрібні функції та змінні, передавши необов’язкові параметри globals та locals у функцію exec():

# Імпортуємо функції з бібліотеки math

# Використовуємо функцію cbrt()
mycode = '''a = cbrt(9)
print(a)'''

# Порожній словник (параметр globals) для обмеження функції cbrt()
exec(mycode, {})
