# В Python для відкриття файлів використовується метод open().

# Тут "r" означає, що файл відкритий для читання.
file1 = open("errors.md", "r")

# r	Відкрити файл для читання (використовується за замовчуванням).
# w	Відкрити файл для запису. Створює новий файл, якщо він не існує, або видаляє вміст файлу, якщо існує.
# x	Відкрити файл для ексклюзивного створення. Якщо файл вже існує, операція завершується невдало.
# a	Відкрити файл для додавання даних у кінець файлу без видалення поточного вмісту. Створює новий файл, якщо він не існує.
# t	Відкрити файл в текстовому режимі (використовується за замовчуванням).
# b	Відкрити файл у двійковому режимі.
# +	Відкрити файл для оновлення (читання та запис).

# Ось кілька простих прикладів того, як відкрити файл у різних режимах:

file1 = open("test.txt")      # рівнозначний 'r' або 'rt'
file1 = open("test.txt", 'w')  # запис у текстовому режимі
file1 = open("img.bmp", 'r+b')  # читання та запис у двійковому режимі
