# Для того, щоб записати дані у файл в Python, нам потрібно відкрити його
# в режимі запису, вказавши "w" у функції open() як другий аргумент. При записі у файл необхідно пам’ятати дві речі:
#   Якщо ми намагаємося відкрити неіснуючий файл, створюється новий файл.
#   Якщо файл уже існує, його вміст видаляється, а до файлу додається новий вміст.

with open('test2.txt', 'w') as file2:

    # Виконуємо запис у файл test2.txt
    file2.write('Programming is Fun.')
    file2.write('Python for beginners')
