# Функція format() форматує вказані значення та вставляє їх у заповнювач рядка.
# Заповнювач визначається за допомогою фігурних дужок {}. Функція format() повертає відформатований рядок.
# format(value[, format_spec])
# Функція format() приймає два параметри:
#    value — значення, яке необхідно відформатувати;
#    format_spec — специфікація того, як слід відформатувати значення.

# Специфікатор формату може бути наступним:
# [[fill]align][sign][#][0][width][,][.precision][type]
# де опції:
# fill        ::=  будь-який символ
# align       ::=  "<" | ">" | "=" | "^"
# sign        ::=  "+" | "-" | " "
# width       ::=  ціле число
# precision   ::=  ціле число
# type        ::=  "b" | "c" | "d" | "e" | "E" | "f" | "F" | "g" | "G" | "n" | "o" | "s" | "x" | "X" | "%"

# s - рядок, можна не вказувати, використовується за замовчуванням;
# b - двійковий формат;
# с - перетворює ціле число на символ Unicode;
# d - десятковий формат;
# e - науковий формат, з малою літерою e;
# E - науковий формат, з E верхнім регістром;
# f - формат чисел із плаваючою комою;
# F - формат чисел із плаваючою комою, верхній регістр;
# g - загальний формат, нижній регістр;
# G - загальний формат, верхній регістр;
# o - Восьмирічний формат;
# x - шістнадцятковий формат, нижній регістр;
# X - шістнадцятковий формат, верхній регістр;
# n - формат цілих чисел;
# % - Відсотковий формат. Множить число на 100 і використовує f для виведення. Наприкінці ставиться %

value = 45

# Форматуємо ціле число у двійкове
binary_value = format(value, 'b')
print(binary_value)


# Форматування числа за допомогою функції format()

# d, f та b є скороченнями назв типів даних

# Ціле число
print(format(123, "d"))

# Число з плаваючою крапкою
print(format(123.4567898, "f"))

# Двійкове число
print(format(12, "b"))
