# Функція format() форматує вказані значення та вставляє їх у заповнювач рядка.
# Заповнювач визначається за допомогою фігурних дужок {}. Функція format() повертає відформатований рядок.
# format(value[, format_spec])
# Функція format() приймає два параметри:
#    value — значення, яке необхідно відформатувати;
#    format_spec — специфікація того, як слід відформатувати значення.

# Специфікатор формату може бути наступним:
# [[fill]align][sign][#][0][width][,][.precision][type]
# де опції:
# fill        ::=  будь-який символ
# align       ::=  "<" | ">" | "=" | "^"
# sign        ::=  "+" | "-" | " "
# width       ::=  ціле число
# precision   ::=  ціле число
# type        ::=  "b" | "c" | "d" | "e" | "E" | "f" | "F" | "g" | "G" | "n" | "o" | "s" | "x" | "X" | "%"

value = 45

# Форматуємо ціле число у двійкове
binary_value = format(value, 'b')
print(binary_value)


# Форматування числа за допомогою функції format()
