# Заморожена множина (англ. “frozen set”) — це просто незмінна версія множини в Python.
# Хоча елементи звичайної множини можна змінити у будь-який час, елементи замороженої
# множини залишаються незмінними після створення. Завдяки цьому заморожені множини можуть
# бути використані як ключі в словнику або як елементи іншої множини.
# Але як і множини, вони не впорядковані (елемент можна поставити в будь-який індекс).

# Робота функції frozenset() в Python

# Кортеж голосних літер
vowels = ('a', 'e', 'i', 'o', 'u')

fSet = frozenset(vowels)
print('The frozen set is:', fSet)
print('The empty frozen set is:', frozenset())

# Заморожені множини - незмінні
fSet.add('v')
