# Зворотний виклик — це функція, яка передається як аргумент іншій функції.
# Очікується, що ця інша функція викликає цю функцію зворотного виклику у
# своєму визначенні. Точка, коли інша функція викликає нашу функцію зворотного
# виклику, залежить від вимог і характеру іншої функції. Функції зворотного
# виклику зазвичай використовуються з асинхронними функціями.
def callback(a, b):
    print('Sum = {0}'.format(a+b))


def main(callback=None):
    print('Add any two digits.')
    if callback != None:
        callback


main(callback(1, 2))
