# Функція ‒ це блок коду, який виконує певне завдання при його виклику (зверненні).
# Ви можете використовувати функції, щоб зробити свій код придатним для повторного використання,
# краще організованим і більш читабельним. Функції можуть приймати параметри та повертати значення.
def message():
    print("Введіть значення: ")
 
message()
a = int(input())
message()
b = int(input())
message()
c = int(input())
 
print(a, b, c)

# Позиційна передача параметрів. Прийом, при якому і-му (першому, другому і т.д.) параметру
# функції# присвоюється і-й (перший, другий і т.д.) аргумент, називається позиційною передачею
# параметрів, а аргументи, що передаються таким чином, називаються позиційними аргументами.
def introduction(first_name, last_name):
    print("Привіт, мене звати", first_name, last_name)
 
introduction("Люк", "Скайвокер")
introduction("Джессі", "Уілсон")
introduction("Кларк", "Кент")

def intro(a="Джеймс Бонд", b="Бонд"):
     print("Мене звати", b + ".", a + ".")
 
intro()
  
# Передача іменованого аргументу. Python пропонує іншу конструкцію передачі аргументів,
# коли значення аргументу визначається його іменем, а не позицією
def introduction(first_name, last_name):
    print("Привіт, мене звати", first_name, last_name)
 
introduction(first_name = "Джеймс", last_name = "Бонд")
introduction(last_name = "Скайвокер", first_name = "Люк")
 
# Змішування позиційних і іменованих аргументів. Якщо хочете, то ви можете змішати обидва варіанти,
# але є одне непорушне правило: позиційні аргументи потрібно ставити перед аргументами ключових слів.
def adding(a, b, c):
    print(a, "+", b, "+", c, "=", a + b + c)
 
adding(3, c = 1, b = 2) # a = позиційна передача, c,d = іменована

# значення за замовчуванням (наперед визначені), якщо їх відповідні аргументи були відсутні.
def introduction(first_name, last_name="Сміт"):
     print("Привіт, мене звати", first_name, last_name)
 
introduction("Генрі") # виведе: Генрі Сміт
introduction(first_name="Вільям") # виведе: Вільям Сміт
introduction("Бетті", "Джонсон") # виведе: Бетті Джонсон (ключове слово аргументу замінено на "Джонсон")

 
