# Якщо вивести змінні, то бачимо, що значенням змінної l є список,
# а змінна g зберігає в собі об'єкт генератора. І тут постає питання: що ж використовувати?

# Якщо вам потрібен результат (наприклад, у вигляді списку) прямо зараз
# для подальшого виконання програми — тоді використовуйте генератори колекцій.

# А якщо значення знадобляться ще не скоро або невідомо, чи знадобиться взагалі,
# то краще генератори, щоб не займати зайву пам'ять і не навантажувати систему.

l = [i for i in range(5)]
g = (i for i in range(5))

print(l)
# [0, 1, 2, 3, 4]

print(g)
# <generator object <genexpr> at 0x7ff7180faf90>

for i in g:
    print(i, end=' ')

# 0 1 2 3 4
