# Функція init є конструктором класу, і вона викликається автоматично при створенні нового екземпляра класу.
# Ця функція використовується для ініціалізації атрибутів, які належать об'єктам, що створюються за допомогою класу.

class Person:
    def __init__(self, name, age):
        self.name = name
        self.age = age


person1 = Person("John", 30)
person2 = Person("Alice", 25)

print(person1.name)  # output: John
print(person2.age)    # output: 25

# Всередині функції init визначаються атрибути об'єкта, які будуть доступні через посилання на екземпляр, на який посилається змінна self.
