# Python пропонує два дуже потужні оператори, здатні переглядати список для того,
# щоб перевірити, чи зберігається певне значення всередині списку чи ні . 
# Перший з них (in) перевіряє, чи заданий елемент (лівий аргумент) в даний момент
# зберігається всередині списку (правий аргумент) ‒ при виконанні цієї умови
# оператор повертає значення True. Другий (not in) перевіряє, чи заданий
# елемент (лівий аргумент) відсутній у списку - при виконанні
# цієї умови оператор повертає значення True.
my_list = [2, 42, 13, 88, 36, 49, 114, 99, 41, 9, 63, 200]

print(36 in my_list) # Чи наявний 36 у списку? True
print(5 not in my_list) # Чи відсутній 5 у списку? True
print(12 in my_list) # Чи наявний 12 у списку? False
print(114 not in my_list) # Чи відсутній 114 у списку? False