# Новий елемент можна приклеїти до кінця існуючого списку. Така операція виконується методом append(). 
# Він приймає значення аргументу та розміщує його в кінці списку, на який вказує метод.
# Після цього довжина списку збільшується на одиницю.
numbers = [111, 7, 2, 1]
print(len(numbers))
print(numbers)

numbers.append(4)

print(len(numbers))
print(numbers)

# Метод insert() трохи розумніший ‒ він може додати новий елемент в будь-яке місце списку, а не тільки в кінець. 
# Потрібно два аргументи: перший вказує на необхідну позицію вставки елемента; 
# примітка: всі існуючі елементи, які займають місця праворуч від нового елемента (в тому числі і той, що знаходиться на вказаній позиції),
# зміщуються вправо, для того, щоб звільнити місце для нового елемента; другий ‒ це елемент, який потрібно вставити.

numbers.insert(0, 222)
print(len(numbers))
print(numbers)

numbers.insert(1, 333)
print(len(numbers))
print(numbers)

# Ви можете почати існування списку, зробивши його порожнім (це робиться за допомогою порожньої пари квадратних дужок),
# а потім додавати до нього нові елементи за потребою.
my_list = [] # Створення порожнього списку.

for i in range(5):
    my_list.append(i + 1)

print(my_list)

# or insert

my_list = []  # Створення порожнього списку.
 
for i in range(5):
    my_list.insert(0, i + 1)
 
print(my_list)
