# Списки в Python використовуються для одночасного зберігання багатьох даних.
# Список створюється шляхом розміщення елементів всередині квадратних дужок [],
# розділених комами. Список може містити будь-яку кількість елементів,
# і вони можуть бути різних типів (int, float, string тощо).

# Список із 3 цілих чисел
numbers = [1, 2, 5]

print(numbers)


# Список може містити будь-яку кількість елементів і вони можуть бути різних
# типів (int, float, string тощо). Наприклад:
# Порожній список
empty_list = []

# Список із змішаними типами даних
my_list = [1, "Hello", 3.4]

print(my_list)

# В Python кожен елемент списку асоціюється з індексом. Ми можемо отримати
# доступ до елементів масиву, використовуючи номер індексу (0, 1, 2,…). Наприклад:

languages = ["Python", "Swift", "C++"]

# Отримуємо доступ до елемента під індексом 0
print(languages[0])   # виведе Python

# Отримуємо доступ до елемента під індексом 2
print(languages[2])   # виведе C++

# Python дозволяє використовувати від’ємний індекс для своїх послідовностей.
# Індекс -1 відноситься до останнього елемента, -2 відноситься до
# передостаннього елемента і так далі. Наприклад:

# Отримуємо доступ до елемента під індексом 0
print(languages[-1])   # виведе C++

# Отримуємо доступ до елемента під індексом 2
print(languages[-3])   # виведе Python
