# Списки можуть бути вкладеними, можуть зберігати різні типи даних, наприклад:
my_list = [1, 'a', ["список", 64, [0, 1], False]]

# змінити значення вибраного елемента в списку
numbers = [10, 5, 7, 2, 1]
print("Оригінальний вміст списку:", numbers)  # Виведення початкового вмісту списку.
 
numbers[0] = 111
print("Новий вміст списку: ", numbers)  # Поточний вміст списку.

# значення п’ятого елемента було скопійоване до другого елемента
numbers = [10, 5, 7, 2, 1]
print("Оригінальний вміст списку:", numbers)  # Виведення початкового вмісту списку.
 
numbers[0] = 111
print("\nВміст попереднього списку:", numbers)  # Виведення попереднього вмісту списку.
 
numbers[1] = numbers[4]  # Копіювання значення п'ятого елемента в другий.
print("Новий вміст списку:", numbers)  # Виведення поточного вмісту списку.

#До кожного з елементів списку можна отримати доступ окремо. Наприклад, його можна вивести на екран:
print(numbers[0]) # Доступ до першого елемента списку.

# Виведення довжини списку
print("\nДовжина списку:", len(numbers)) # Виведення довжини списку.

# Видалення елементів зі списку
del numbers[1]
print(len(numbers))
print(numbers)

# Від'ємні індекси. Елемент з індексом, рівним -1, є останнім у списку, елемент з індексом -2 буде передостаннім у списку.
numbers = [111, 7, 2, 1]
print(numbers[-1])
print(numbers[-2])

# ви можете легко поміняти місцями елементи списку, щоб змінити їх порядок
my_list = [10, 1, 8, 3, 5]
 
my_list[0], my_list[4] = my_list[4], my_list[0]
my_list[1], my_list[3] = my_list[3], my_list[1]
 
print(my_list)
 
# можна за допомогою циклу for це автоматизувати, незалежно від того, яка довжина списку
my_list = [2, 42, 13, 88, 36, 49, 114, 99, 41, 9, 63, 200]
length = len(my_list) # присвоюємо змінній length довжину поточного списку
for i in range(length // 2):
    my_list[i], my_list[length - i - 1] = my_list[length - i - 1], my_list[i]
 
print(my_list)
 
