# Зріз [:] ‒ це елемент синтаксису Python, який дозволяє зробити абсолютно нову копію списку або частини списку.
list_1 = [1, 2, 3]
list_2 = list_1[:]
list_1[0] = 2
print(list_2) # Результат [1, 2, 3]
 
# Якщо копіювати без зрізу:
list_1 = [1, 2, 3]
list_2 = list_1
list_1[0] = 2
print(list_2) # Результат [2, 2, 3]
 
# Копіювання частини списку. Зріз my_list[start:end]
my_list = [2, 42, 13, 88, 36, 49, 114, 99, 41, 9, 63, 200]
new_list = my_list[1:3]
print(new_list)

# Можна вказати тільки [start:] або [:end]
my_list = [2, 42, 13, 88, 36, 49, 114, 99, 41, 9, 63, 200]
new_list = my_list[4:]
print(new_list)

my_list = [2, 42, 13, 88, 36, 49, 114, 99, 41, 9, 63, 200]
new_list = my_list[:6]
print(new_list)
 
