# Функція map() виконує вказану функцію до кожного елементу ітерованого об’єкта (списку, кортежу тощо)
# та повертає ітератор, який містить результати.
# Синтаксис функції map(): map(func, *iterables)
# Функція map() приймає два параметри:
#   func — функція, яка застосовується до кожного елемента ітерованого об’єкта;
#   *iterables — будь-яка кількість ітерованих об’єктів (таких як множини, списки, кортежі тощо), може бути більше одного.

numbers = [2, 4, 6, 8, 10]

# Повертає число в квадраті


def square(number):
    return number * number


# Застосовуємо функцію square() до кожного елементу списку
squared_numbers_iterator = map(square, numbers)

# Конвертуємо в список
squared_numbers = list(squared_numbers_iterator)
print(squared_numbers)
