# Форма масиву — це кількість елементів у кожному вимірі.
# Змінюючи форму, можна додавати чи видаляти виміри.
# Це робиться за допомогою функції reshape бібліотеки NumPy.

import NumPy as np

arr = np.array([1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12])
newarr = arr.reshape(4, 3)
print(newarr)

# [[1 2 3]
# [4 5 6]
# [7 8 9]
# [10 11 12]]

arr1 = np.array([1, 2, 3, 4, 5, 6, 7, 8])
newarr1 = arr1.reshape(3, 3)
print(newarr1)
# ValueError: cannot reshape array of size 8 into shape (3,3)

# У цьому прикладі одномірний масив з 12 елементами перетворюється на двомірний.
# Спроба перетворити масив на математично неможливу форму викличе ValueError.
