# Подібне до функціоналу на global, ключове слово nonlocal дозволяє звертатися
# до змінних з нелокальної області видимості. Поведінка nonlocal полягає в тому,
# що інтерпретатор шукає змінну в найближчій області видимості.
# Основна відмінність з global в тому, що за допомогою nonlocal не можна
# отримати змінні з глобальної області видимості.

def outer():
    x = 'local'

    def inner():
        nonlocal x
        x = 'nonlocal'
        print('inner:', x)

    inner()
    print('outer:', x)


outer()
