# Функція open() відкриває файл та повертає його як файловий об’єкт.

# Функція open() приймає 8 параметрів:
#   file — об’єкт (і шлях у файловій системі до нього);
#   mode (не обов’язково) — режим під час відкриття файлу. Якщо не вказано, то за замовчуванням використовується значення 'r' (відкрито для читання в текстовому режимі). Нижче наведено доступні режими файлів:

# ‘r’	Відкрити файл для читання. (використовується за замовчуванням)
# ‘w’	Відкрити файл для запису. Створюється новий файл, якщо він не існує або видаляється вміст файлу, якщо він існує.
# ‘x’	Відкривається файл для ексклюзивного створення. Якщо файл вже існує, операція завершиться невдало.
# ‘a’	Відкрити файл, щоб додати дані в кінець файлу без видалення поточного вмісту. Створюється новий файл, якщо він не існує.
# ‘t’	Відкрити файл у текстовому режимі. (використовується за замовчуванням)
# ‘b’	Відкрити файл у двійковому режимі.
# ‘+’	Відкрити файл для оновлення (читання та запис).

# Приклад №1: Як відкрити файл у Python?

# Відкриваємо файл test.text поточної директорії
f = open("test.txt")

# Вказуємо повний шлях
f = open("/home/***/README.txt")

# Приклад №2: Вказування режиму в функції open()

# Відкриваємо файл у режимі читання
f = open("path_to_file", mode='r')

# Відкриваємо файл у режимі запису
f = open("path_to_file", mode='w')

# Відкриваємо для запису в кінець файлу
f = open("path_to_file", mode='a')
