# Арифметичні оператори в Python

# +	Додавання
print(6 + 3)
# −	Віднімання
print(6 - 3)
# *	Множення
print(4 * 5)
# /	Ділення
print(8 / 4)
# // Цілочисельне ділення
print(10 // 3)
# %	Залишок від ділення
print(5 % 2)
# ** Піднесення до степеня
print(4 ** 2)


# Оператори присвоювання в Python

# =     Присвоювання
a = 4
# +=	Додавання з присвоюванням
a += 2  # a = a + 2
# −=	Віднімання з присвоюванням
a -= 4  # a = a − 4
# *=	Множення з присвоюванням
a *= 5  # a = a * 5
# /=	Ділення із присвоюванням
a /= 6  # a = a / 6
# %=	Залишок від ділення з присвоюванням
a %= 7  # a = a % 7
# **=	Піднесення до степеня з присвоюванням
a **= 8  # a = a ** 8

# Оператори порівняння в Python

# ==	Дорівнює
2 == 4  # False
# !=	Не дорівнює
2 != 5  # True
# >    	Більше ніж
2 > 4  # False
# <	    Менше ніж
2 < 4  # True
# >=	Більше або Дорівнює
2 >= 4  # False
# <=	Менше або Дорівнює
2 <= 4  # True

# Логічні оператори в Python

# Логічне І (and)
print(True and True)     # True
print(True and False)    # False

# Логічне АБО (or)
print(True or False)     # True

# Логічне НЕ (not)
print(not True)          # False


# Побітові оператори в Python. Побітові оператори працюють з операндами,
# ніби вони є наборами двійкових цифр. Вони працюють з бітами, звідси й назва.
# Наприклад, десяткове 2 — це бінарне 10, а десяткове 7 — це бінарне 111.

# &	Побітове І	(and)
# |	Побітове АБО	(or)
# ~	Побітове НЕ	    (not)
# ^	Побітове XOR	(xor)
# >>	Побітовий зсув вправо
# <<	Побітовий зсув вліво
