# В ході виконання оператора pass в Python нічого не відбувається,
# тому він може використовуватися як певна заглушка в тих місцях,
# де це синтаксично необхідно. Наприклад, треба зробити кілька функцій,
# ви написали def-и і назви, а код ще не встигли, але програму треба
# запустити і перевірити щось інше. Тут і знадобиться pass.

# Порожня функція
def function():
    pass


# Ігнорування помилки
try:
    do_something()
except:
    pass

# Або ж можна використати pass в конструкції try-except,
# щоб просто проігнорувати і ніяк не обробляти помилку в програмі.
