# В ході виконання оператора pass в Python нічого не відбувається,
# тому він може використовуватися як певна заглушка в тих місцях,
# де це синтаксично необхідно. Наприклад, треба зробити кілька функцій,
# ви написали def-и і назви, а код ще не встигли, але програму треба
# запустити і перевірити щось інше. Тут і знадобиться pass.

n = 10

# Використовуємо pass всередині конструкції if
if n > 10:
    pass

print('Hello')


# Порожня функція
def function():
    pass


# Ігнорування помилки
try:
    print(1)
except:
    pass

# Або ж можна використати pass в конструкції try-except,
# щоб просто проігнорувати і ніяк не обробляти помилку в програмі.


# Також ми можемо використати оператор pass у функції чи класі. Наприклад, у функції:

def function(args):
    pass


class Example:
    pass
