# Функція pow() обчислює степінь числа, підносячи перший аргумент в
# степінь (значення) другого аргументу. Наприклад:

# Повертає 2^2
print(pow(2, 2))

# Повертає -2^2
print(pow(-2, 2))

# Повертає 1/2^2
print(pow(2, -2))

# Повертає -1/-2^2
print(pow(-2, -2))

# Функція pow() з модулем

x = 7
y = 2
z = 5

# Обчислюємо x^y%z
print(pow(x, y, z))

# Тут ми піднесли число 7 до степеня 2, у результаті чого отримали 49.
# Оскільки ми використали функцію pow() з трьома аргументами x, y та z,
# то результат 49 ділиться на третій аргумент (модуль) 5 і обчислюється
# остача. Ось чому ми отримали в результаті 4.
