# Python має вбудований модуль random, який можна використовувати для створення випадкових чисел.

from random import random

for i in range(5):
    print(random())


# seed() Ініціалізує генератор випадкових чисел
# getstate() Повертає поточний внутрішній стан генератора випадкових чисел
# setstate() Відновлює внутрішній стан генератора випадкових чисел
# getrandbits() Повертає число, що представляє випадкові біти
# randrange() Повертає випадкове число в заданому діапазоні
# randint() Повертає випадкове число в заданому діапазоні
# choice() Повертає випадковий елемент з заданої послідовності
# choices() Повертає список з випадковою вибіркою з заданої послідовності
# shuffle() Отримує послідовність і повертає послідовність у випадковому порядку
# sample() Повертає задану вибірку послідовності
# random() Повертає випадкове число з плаваючою комою від 0 до 1
# uniform() Повертає випадкове число з плаваючою комою між двома заданими параметрами
# triangular() Повертає випадкове число з плаваючою комою між двома заданими параметрами, ви також можете задати параметр mode, щоб вказати медіану між двома іншими параметрами
# betavariate() Повертає випадкове число з плаваючою комою між 0 та 1 на основі бета-розподілу (використовується у статистиці)
# expovariate() Повертає випадкове число з плаваючою комою на основі експоненціального розподілу (використовується в статистиці)
# gammavariate() Повертає випадкове число з плаваючою комою на основі гамма-розподілу (використовується в статистиці)
# gauss() Повертає випадкове число з плаваючою комою на основі розподілу Гауса (використовується в теорії ймовірностей)
# lognormvariate() Повертає випадкове число з плаваючою комою на основі логнормального розподілу (використовується в теорії ймовірностей)
# normalvariate() Повертає випадкове число з плаваючою комою на основі нормального розподілу (використовується в теорії ймовірностей)
# vonmisesvariate() Повертає випадкове число з плаваючою комою на основі розподілу фон Мізеса (використовується у спрямованій статистиці)
# paretovariate() Повертає випадкове число з плаваючою комою на основі розподілу Парето (використовується в теорії ймовірностей)
# weibullvariate() Повертає випадкове число з плаваючою комою на основі розподілу Вейбулла (використовується у статистиці)
