# Функція range() формує послідовність чисел. Вона приймає цілі числа, а повертає об'єкти з діапазону.
# Синтаксис range() має наступний вигляд: range(start, stop, step), де:
# start ‒ необов'язковий параметр, що задає початковий номер послідовності (за замовчуванням 0)
# stop ‒ необов'язковий параметр, що вказує на кінець згенерованої послідовності (не входить до складу),
# step ‒ необов'язковий параметр, що задає крок інтервалу між числами в послідовності (за замовчуванням ‒ 1).

my_range = range(16)

print(type(my_range))

print(my_range)

print(list(my_range))  # Конвертація в список

other_range = range(5, 21, 5)  # range (початок, кінець, крок діапазону)

print(other_range)
print(list(other_range))

for i in range(3):
    print(i, end=" ")  # результат: 0 1 2

for i in range(6, 1, -2):
    print(i, end=" ")  # результат: 6, 4, 2

# За допомогою range 0-9:
for i in range(10):
    print("Значення i зараз дорівнює", i)

# За допомогою range 2-7:
for i in range(2, 8):
    print("Значення i зараз дорівнює", i)

# Множина, згенерована функцією range(),
# повинна бути відсортована за зростанням.
# Неможливо змусити функцію range() створити
# множину в іншому вигляді, коли функція range()
# приймає саме два аргументи. Це означає, що другий
# аргумент range() повинен бути більшим за перший.


# За допомогою range 2-8 з інкрементом (третій аргумент):
for i in range(2, 9, 3):
    print("Значення i зараз дорівнює", i)

# Перший аргумент, що передається у функцію range(),
# вказує на початковий номер послідовності (звідси 2 на виході).
# Другий аргумент вказує функції, де закінчується послідовність
# (функція генерує числа, до числа вказаного в другому аргументі,
# але не включає його). Нарешті, третій аргумент вказує на крок,
# який фактично дорівнює різниці між прилеглими числами у
# згенерованій функцією послідовності чисел.

# Розглянемо коротку програму, метою якої є обчислення декількох перших степенів двійки:
power = 1
for expo in range(16):
    print("2 в степені", expo, "дорівнює", power)
    power *= 2  # power = power * 2
