# В Python не треба хвилюватися про управління пам'яттю, бо це робиться автоматично.
# Лічильник посилань допомагає при перевірці, чи слід виконувати складання сміття.
# Складальник сміття видаляє об'єкт із пам'яті, якщо на нього нічого не посилається.

import types


# Створюємо об'єкт списку, на який посилається змінна
my_list = [1, 2, 3]

# Оголошуємо іншу змінну, яка посилається на той самий об'єкт
another_list = my_list

# Отримуємо адресу об'єкта у пам'яті
my_list_address = id(my_list)

# Отримуємо кількість посилань на об'єкт
ref_count = c_types.c_long.from_address(my_list_address)

print(f'Посилань на об"єкт: {ref_count.value}')
