# В Python для створення множини всі елементи поміщають усередині фігурних дужок {}, розділених комами.
# Множина може містити будь-яку кількість елементів, і вони можуть бути різних
# типів (int, float, кортеж, рядки тощо). Але множина не може мати змінювані елементи,
# такі як списки, словники або інші множини.

# Множина цілочисленного типу
student_id = {112, 114, 116, 118, 115}
print('Student ID:', student_id)

# Множина рядкового типу
vowel_letters = {'a', 'e', 'i', 'o', 'u'}
print('Vowel Letters:', vowel_letters)

# Множина змішаного типу
mixed_set = {'Hello', 101, -2, 'Bye'}
print('Set of mixed data types:', mixed_set)

# Порожні фігурні дужки створюють порожній словник у Python. А для створення порожньої
# множини потрібно використати функцію set() без жодних аргументів. Наприклад:

# Створення порожньої множини
empty_set = set()

# Перевірка типу даних empty_set
print('Data type of empty_set:', type(empty_set))

# Ітерація по множині в Python

fruits = {"Apple", "Peach", "Mango"}

# Використовуємо цикл for для доступу до кожного елемента
for fruit in fruits:
    print(fruit)
