# Функція sorted() сортує елементи вказаного ітерованого об’єкта в
# певному порядку (за зростанням або за спаданням) і повертає їх у вигляді списку.

numbers = [4, 2, 12, 8]

sorted_numbers = sorted(numbers)
print(sorted_numbers)

# Функція sorted() може приймати максимум три параметри:
#    iterable — послідовність (рядок, кортеж, список) або колекція (множина, словник, заморожена множина) або будь-який інший ітератор;
#    key (не обов’язково) — функція, яка є ключем для виконання сортування. За замовчуванням використовується None;
#    reverse (не обов’язково) — якщо значення дорівнює True, то відсортований список буде “зворотним” (або відсортованим за спаданням). За замовчуванням використовується значення False.
