# Функція staticmethod() повертає статичний метод для цієї функції.

class Calculator:

    def add_numbers(num1, num2):
        return num1 + num2


# Конвертуємо метод add_numbers() у статичний метод
Calculator.add_numbers = staticmethod(Calculator.add_numbers)

sum = Calculator.add_numbers(5, 7)
print('Sum:', sum)

# Статичні методи, як і методи класу — це методи, які прив’язані до класу,
# а не до його об’єкта. Вони не потребують створення об’єкта класу. Таким чином вони не залежать від стану об’єкта.
# Різниця між статичним методом та методом класу полягає в наступному:
#    статичні методи нічого не знають про клас і працюють лише з параметрами;
#    метод класу працює із класом, оскільки його параметром завжди є сам клас.
# Вони можуть бути спричинені як самим класом, так і його об’єктом:
#   Class.staticmethodFunc()
#   Class().staticmethodFunc()
