# Функція str() повертає рядкове представлення вказаного об’єкта.
# str(object, encoding='utf-8', errors='strict'), параметри encoding та errors призначені лише для використання, коли тип object — це байти або байтовий масив.
# Функція str() приймає три параметри:
#    object — об’єкт, рядкове представлення якого потрібно повернути;
#    encoding (не обов’язково) — кодування, в яке потрібно декодувати даний байтовий об’єкт (може використовуватися UTF-8, ASCII тощо). За замовчуванням використовується utf-8;
#    errors (не обов’язково) — відповідь при невдалому декодуванні (може бути strict, ignore, replace тощо).

# Рядкове представлення Adam
print(str('Adam'))
