# Операції над рядками

str1 = 'abc'
str2 = 'xyz'

# оператор +, що використовується для двох або більше рядків,
# створює новий рядок, що містить усі символи з його аргументів (примітка: порядок має значення)
print(str1 + str2)
print(str2 + str1)

# оператору * потрібні рядок і число як аргументи; у цьому випадку порядок не має значення – ви можете поставити число перед рядком,
# або навпаки, результат буде той самий – новий рядок, створений n-ою копією рядка аргументу.
print(5 * 'a')
print('b' * 4)
