# truncate() змінює розмір файлу до заданої кількості байтів. Якщо розмір не вказано, використається поточна позиція.

# Зверніть увагу: якщо вказаний розмір перевищує поточний розмір файлу, результат буде залежати від платформи.

f = open("demofile2.txt", "a")
f.truncate(20)
f.close()

f = open("demofile2.txt", "r")
print(f.read())

# Файл може залишитися незмінним, збільшитися до вказаного розміру, якщо він був заповнений нулями, або збільшитися до вказаного розміру з невизначеним новим вмістом.
