# tuple (кортеж) -  це тип незмінної послідовності. Він може поводитися як список, але не може 
# бути змінений в процесі виконання. Перша і найбільш очевидна відмінність списків від кортежів 
# полягає в синтаксисі, який використовується для їх створення ‒ кортежі створюють за допомогою
# круглих дужок, в той час як списки ‒ за допомогою квадратних дужок, хоча також можна створити
# кортеж просто з набору значень, розділених комами.
tuple_1 = (1, 2, 4, 8)
tuple_2 = 1., .5, .25, .125
 
print(tuple_1)
print(tuple_2)
 
# Якщо ви хочете створити одноелементний кортеж, ви повинні враховувати той факт, 
# що з синтаксичних міркувань (кортеж повинен відрізнятися від звичайного, 
# одиночного значення), ви повинні закінчити значення комою:
one_element_tuple_1 = (1, )
one_element_tuple_2 = 1.,

# Приклади використання
my_tuple = (1, 10, 100)

t1 = my_tuple + (1000, 10000) # можна об'єднувати кортежі між собою
t2 = my_tuple * 3 # можна перемножувати кортежі так само як і списки

print(len(t2)) # приймає кортежі і повертає кількість елементів, що містяться всередині
print(t1)
print(t2)
print(10 in my_tuple) # Перевіряє наявність 10 в кортежі
print(-10 not in my_tuple) # Перевіряє відсутність -10 в кортежі

# елементами кортежу можуть бути змінні, а не тільки літерали. Більше того, вони можуть
# бути виразами, якщо стоять у правій частині оператора присвоювання.
var = 123

t1 = (3, "var", 44, "car", var)

print(t1)
 

